test/tsung/test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "./tsung-1.0.dtd" [] >
<tsung loglevel="debug">
  
 <!-- Clients setup -->  
 <clients>  
  <client host="localhost" use_controller_vm="true" maxusers="60000"></client>  
 </clients>  
   
 <!-- Servers setup -->  
 <servers>  
  <server host="42.121.0.192" port="5222" type="tcp"></server>  
 </servers>  
   
 <!-- Load User -->  
 
 <load>
  <arrivalphase phase="1" duration="1" unit="minute">
    <users interarrival="1" unit="second"></users>
  </arrivalphase>
 </load>
  
 <!-- Jabber parameters -->  
 <options>  
  <option type="ts_jabber" name="global_number" value="100"></option>  
  <option type="ts_jabber" name="userid_max" value="1000000"></option>  
  <option type="ts_jabber" name="domain" value="dface.cn"></option>  
  <option type="ts_jabber" name="username" value="s1"></option>  
  <option type="ts_jabber" name="passwd" value="pass"></option>  
  <option type="ts_jabber" name="muc_service" value="c.dface.cn"/>
 </options>  
   
 <!-- Session TODO -->  

<sessions>
 <session probability="100" name="jabber-example" type="ts_jabber">

    <request> <jabber type="connect" ack="local" /> </request>

   <transaction name="authenticate">  
    <request><jabber type="auth_sasl" ack="local"/></request> 
    <request><jabber type="auth_sasl_bind0" ack="local"></jabber></request> 
    <request><jabber type="auth_sasl_bind" ack="local"></jabber></request> 
    <request><jabber type="auth_sasl_session" ack="local"></jabber></request>  
   </transaction>  

   <request><jabber type="presence:initial" ack="no_ack"/></request>  
   <request> <jabber type="chat" ack="no_ack" size="16" destination="online"/></request>
   <thinktime value="1"></thinktime>    

<setdynvars sourcetype="random_number" start="1" end="100">
 <var name="room"/>
</setdynvars>
<setdynvars sourcetype="random_string" length="10">
 <var name="nick1"/>
</setdynvars>
<request subst="true">
  <jabber type='muc:join' ack = "local" room = "room%%_room%%" nick = "%%_nick1%%"/>
</request>

<for from="1" to="6" var="i">
 <thinktime value="3"/>
 <request subst="true">
   <jabber type="muc:chat" ack="no_ack" size="16" room =
   "room%%_room%%"/>
 </request>
</for>

   <thinktime value="100"></thinktime>    

    <transaction name="close">
      <request> <jabber type="close" ack="local"> </jabber></request>
    </transaction>
  </session>
</sessions>

</tsung>